Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memb.tmx
Source language: cat
Languages: es

source: Una impressora (d'injecció o de raig de tinta ---la més típica---, o làser).
es: Una impresora (de inyección o de tinta --- la más típica ---, o de láser ).

source: [386:] Un model de processador central de la família 86, dissenyat per Intel i comercialitzat també per altres companyies, que es troba en ordinadors personals del tipus PC.
es: [386:] Un modelo de procesador central de la familia 86, diseñado por Intel y comercializado también por otras compañías, que se encuentra en ordenadores personales del tipo PC.

source: [3.] Si el caràcter en la posició $p$ de $A$ és `\$', digues sí i para.
es: ] Si el carácter en la posición $ p $ de $ A $ es `\ $ ', di sí </ i1> y para.

source: Altres components, com ara la memòria RAM, també funcionen a una determinada velocitat, independent de la del processador, que es mesura també en MHz.
es: Otros componentes, como la memoria RAM, también funcionan con una velocidad determinada, independiente de la del procesador, que se mide también en MHz.

source: [4.] Si el caràcter en la posició $p$ de $A$ no és igual al caràcter en la posició $p$ de $B$, vés a 8.
es: ] Si el carácter en la posición $ p $ de $ A $ no es igual al carácter en la posición $ p $ de $ B $, ve a 8.

source: En el cas de les línies elèctriques, la tecnologia rep també el nom de PLC (power line communications o comunicacions a través de les línies de força).
es: En el caso de las líneas eléctricas , la tecnología recibe también el nombre de PLC (<I1> powe line communications o comunicaciones a través de líneas de fuerza.

source: [PCMCIA] (de l'anglés Personal Computer Memory Card International Association, associació internacional de targetes de memòria per a ordinadors personals): nom d'un estàndard de targetes de memòria, mòdems, discos, unitats de disquets, targetes de xarxa i altres dispositius perifèrics per a ordinadors portàtils.
es: [PCMCIA] (del inglés Personal Computer Memory Card International Association </ i0>, asociación internacional de tarjetas de memoria para ordenadores personales): nombre de un estándar de tarjetas de memoria, módems, discos, unidades de disquetes, tarjetas de red y otros dispositivos periféricos para ordenadores portátiles.

source: [8.] Digues no i para.
es: ] Di no </ i1> y para.

source: Els anomenats de densitat doble (DD) ---molt poc usats actualment--- poden contenir 720 kB, és a dir, la meitat.
es: Los conocidos como densidad doble (DD) ---poco usados en la acutalidad--- pueden contener 720 kB, es decir, la mitad.

source: Hi ha molts tipus d'adaptadors de vídeo.
es: Hay muchos tipos de adaptadores de vídeo

source: Els fitxers són conjunts de dades amb un nom que els identifica i que es manipulen ---s'obrin, es tanquen, es copien, s'esborren--- com un tot.
es: Los ficheros son conjuntos de datos con un nombre que los identifica y que se manipulan --- abrir, cerrar, copiar,borrar --- como un todo.

source: Per exemple, actualment és comú que un PC tinga un processador AMD ATHLON 64 X2 Dual-Core (vegeu el glossari, apartat ) a 2 GHz o un processador equivalent de la marca Intel (p.e., un Intel Pentium D 925 a 3 GHz), 1 GB de memòria RAM i uns 80 GB de disc dur.
es: Por ejemplo, actualmente es común que un PC tenga un procesador AMD ATHLON 64 X2 Dual-Core (ver el glosario, apartado 2.8 ) a 2 GHz o un procesador equivalente de la marca Intel (p.e, un Intel Pentium D 925 a 3 GHz), 1 GB de memoria RAM y unos 80 GB de disco duro.

source: Aquests ordinadors es poden presentar en grups connectats entre sí per a oferir major potència i capacitat i es munten de vegades en armaris especials anomenats racks.
es: Estos ordenadores se pueden presentar en grupos conectados entre sí para ofrecer mayor potencia y capacidad y se montan a veces en armarios especiales llamados racks </ e6>.

source: Tota la informació ---instruccions de programa o dades--- que s'emmagatzema en la memòria d'un ordinador s'hi guarda en forma binària; és a dir, cada dada és una cadena de dígits binaris o bits.
es: Toda la información --- instrucciones de programa o datos --- que se almacena en la memoria de un ordenador se guarda en forma binaria, es decir, cada dato es una cadena de dígitos binarios o bits </ i0>.

source: Tot i que fa uns anys el seu preu era molt superior al d'un ordinador de sobretaula, avui la diferència és cada vegada més reduïda.
es: Aunque hace algunos años su precio era muy superior al de un ordenador de sobremesa, hoy la diferencia es cada vez más reducida.

source: [6.] Vés al pas 2.
es: ] Ir al paso 2.

source: En discos grans, seria molt incòmode tenir tots els fitxers un darrere l'altre; per això, és comú que els fitxers estiguen organitzats en { directoris}.
es: En discos grandes, sería muy incómodo tener todos los archivos uno tras otro, por lo que es normal que los archivos estén organizados en { directorios} .

source: Aquestes targetes no són massa diferents en grandària d'una targeta de crèdit i s'insereixen en el port corresponent de l'ordinador, amb la peculiaritat que en permeten l'inserció i l'extracció ``en calent'', és a dir, sense haver d'apagar l'ordinador.
es: Estas tarjetas no son demasiado diferentes en tamaño de una tarjeta de crédito y se insertan en el puerto correspondiente del ordenador, con la peculiaridad de que permiten su inserción y la extracción " en caliente", es decir , sin tener que apagar el ordenador.

source: [De mà o de butxaca] (en anglés handheld): Tenen una grandària una mica més gran que la d'una calculadora i poden considerar-se hereus de les antigues agendes electròniques, tot i que els ordinadors de mà (coneguts també com a PDA per Personal Digital Assistant, assistent digital personal) porten un sistema operatiu potent que permet fer-los servir en tasques como ara l'edició de documents o la navegació per Internet a través d'una connexió sense fils.
es: [De mano o de bolsillo] (en inglés handheld </ i7>): Tienen un tamaño algo mayor que la de una calculadora y pueden considerarse herederos de las antiguas agendas electrónicas, aunque los ordenadores de mano (conocidos también como PDA </ i4> para Personal Digital Assistant </ i5>, asistente digital personal) llevan un sistema operativo potente que permite utilizarlos en tareas tales como la edición de documentos o la navegación por Internet a través de conexión inalámbrica.

source: Els portàtils actuals porten quasi tots pantalles TFT.
es: Los portátiles actuales llevan casi todos pantallas TFT.

source: on A[p] representa el caràcter que hi ha en la posició p de la seqüència A.
es: on A[p] representa el carácter que hi ha en la posició p de la secuencia A.

source: Aquest matemàtic va introduir el sistema decimal hindú en el món àrab.
es: Este matemático introdujo el sistema decimal hindú en el mundo árabe.

source: Aquest algorisme està relacionat amb la recerca d'un mot en un diccionari, per exemple.
es: Este algoritmo está relacionado con la búsqueda de una palabra en un diccionario, por ejemplo.

source: Un octet pot contenir, per tant, molt poca informació (un caràcter, una instrucció senzilla del processador central, un nombre de 0 (``{ 00000000}'') a 255 (``{ 11111111}''), etc.).
es: Un byte puede contener, por tanto, muy poca información (un carácter, una instrucción sencilla del procesador central, un número de 0 (" { 00000000}") a 255 (" { 11111111} ' '), etc.).

source: [Wi-Fi] (de l'anglés wireless fidelity, fidelitat sense fils): tecnologia de connexió sense fils (via ràdio), principalment per a formar xarxes locals, que pot arribar fins als 54 Mbps de velocitat de transmissió.
es: [Wi-Fi] (del inglés wireless fidelity, fidelidad inalámbrica): tecnología de conexión inalámbrica ( vía radio), principalmente para formar redes locales, que puede llegar hasta los 54Mbps de velocidad de transmisión.

source: Els ordinadors de mà es poden connectar (amb cables o mitjançant tecnologies sense cables) a altres dispositius (ordinadors, telèfons mòbils, impressores, etc.) per compartir dades.
es: Los ordenadores de mano se pueden conectar (con cables o a través de tecnologías sin cables) a otros dispositivos (ordenadores, teléfonos móviles, impresoras, etc.) para compartir datos.

source: Memòria
es: Memoria

source: [3.] Si no existeix la posició $p$ de $B$, vés a 8.
es: ] Si no existe la posición $ p $ de $ A $, ve a 7.

source: [Servidors:] Els servidors són ordinadors que contenen i gestionen informació que s'utilitzarà en d'altres ordinadors (``clients'') connectats a ells a través d'una xarxa interna o a través d'Internet; no són massa diferents d'un ordinador de sobretaula, típicament més potents quant a memòria, disc i processador, però, com que ningú ha de seure davant d'ells no solen tenir pantalles, teclats o ratolins.
es: [Servidores:] Los servidores son ordenadores que contienen y gestionan información que se utilizará en otros ordenadores (" clientes") conectados a ellos a través de una red interna o a través de Internet, no son demasiado diferentes de un ordenador de sobremesa, típicamente más potentes en cuanto a memoria, disco y procesador, pero como nadie tiene que sentarse delante de ellos no suelen tener pantallas, teclados o ratones.

source: Els directoris són fitxers especials que agrupen els noms i les característiques d'altres fitxers; de fet, els directoris poden contenir zero o més fitxers o també zero o més directoris (sense restriccions de quantitat), i així successivament, de manera que la persona usuària pot establir una estructuració jeràrquica o arbòria dels seus fitxers en el disc.
es: Los directorios son ficheros especiales que agrupan los nombres y las características de otros ficheros, de hecho, los directorios pueden contener cero o varios archivos o cero o más directorios (sin restricciones de cantidad), y así sucesivamente, de modo que la persona usuaria puede establecer una estructuración jerárquica o arbórea de sus ficheros en el disco.

source: ) ) ) En aquest disc, el directori principal, ``{}'', conté un únic [sub]directori ``{prac1}''; aquest directori conté dos [sub]directoris, ``{iat}'' (que conté els fitxers ``iat1.txt'' i ``iat2.txt'') i ``{reserva}''.
es: En este disco, el directorio principal, " {}", contiene un único [sub] directorio " {prac1}"; este directorio contiene dos [ sub] directorios, " {iado}" (que contiene los archivos " iat1.txt </ i0>" y " iat2.txt </ i1>") y " {reserva}".

source: { func compara(A, B : sequencia de car); var p : entera ; etiquetes : 2 ; inici p:=1; 2: si A[p]<>B[p] llavors retorna 'no'; si A[p]='\$' llavors retorna 'si' p:=p+1; vesa 2; fi; }
es: { Func compara (A, B: secuencia de caro); </ i0> var p: entera; </ i1> etiquetas: 2; <i2 > </ i2> inicio </ i3> p: = 1; </ i4> 2: si A [p] <> B [p] entonces devuelve 'no'; </ i5> si A [p] = '\ $' entonces vuelve 'si' </ e6> p: = p +1; </ i7> ve a a 2; </ i8> fin; }

source: El Pentium original ha anat evolucionant durant els últims anys: Pentium Pro, Pentium II, Pentium III, Pentium 4 etc.
es: El Pentium original ha ido evolucionando durante los últimos años: Pentium Pro, Pentium II, Pentium III, Pentium 4 etc.

source: Fixeu-vos que dues carpetes diferents contenen arxius amb el mateix nom ``iat1.txt''; això no és problema si considerem la trajectòria completa com a nom del fitxer.
es: Tenga en cuenta que dos carpetas diferentes contienen archivos con el mismo nombre " iat1.txt </ i3>"; eso no es problema si consideramos la trayectoria completa como nombre del archivo.

source: [2.] Si el caràcter en la posició $p$ de $A$ no és igual al caràcter en la posició $p$ de $B$, digues no i para.
es: ] Si el carácter en la posición $ p $ de $ A $ no es igual al carácter en la posición $ p $ de $ B $, di no </ i0> y para.

source: L'execució d'una instrucció per part del processador sol consumir un nombre menut de cicles, quasi sempre més d'un. Una velocitat típica (any 2006) és 3 GHz, és a dir, 3000 MHz.
es: La ejecución de una instrucción por parte del procesador suele consumer un número pequeño de ciclos, casi siempre más de uno. Una velocidad típica (año 2006) es de 3 GHz, es decir, 3000 Mhz

source: És el successor del 386 ---té un conjunt d'instruccions més complet---, i processa, com aquest, 32 bits per cicle; tots els programes escrits per a ser executats pels processadors 386 poden ser executats pels processadors 486.
es: Es el sucesor del 386 --- tiene un conjunto de instrucciones más completo ---, y procesa, como éste, 32 bits por ciclo; todos los programas escritos para ser ejecutados por los procesadores 386 pueden ser ejecutados por los procesadores 486

source: Una targeta de comunicacions (mòdem o targeta de xarxa, amb fils o sense fils vegeu el glossari, apartat ).
es: Una tarjeta de comunicaciones (módem o tarjeta de red, con cables o sin cables, véase el glosario, apartado ).

source: Tipus d'ordinadors
es: Tipos de ordenadores

source: Es pot instal·lar Linux (que es presenta en moltes distribucions diferents) en un PC amb processador 386 o superior i en molts altres tipus d'ordinador.
es: Se puede instalar Linux (que se presenta en muchas distribuciones </ i0> diferentes) en un PC con procesador 386 o superior y en muchos otros tipos de ordenador.

source: Per exemple, els caràcters i símbols més comunament usats en textos se solen guardar cada un en un octet, usant el codi ASCII (American Standard Code for Information Interchange), on el codi de la ``{ A}'' és ``{ 01000001}'' o el de la ``{ z}'' és ``{ 01111010}'' (vegeu l'epígraf ).
es: Por ejemplo, los caracteres y símbolos más comúnmente usados en textos se suelen guardar cada uno en un byte, usando el código ASCII ( American Standard Code for Information Interchange </ i1>), donde el código de la ` `{ A}" es " { 01000001}" o el de la " { z}" es " { 01111010}" (véase el epígrafe ).

source: [Linux:] un sistema operatiu multitasca i multiusuari gratuït, de l'estil de l'Unix que es podia trobar en els miniordinadors, desenvolupat de manera no lucrativa per milers de voluntaris arreu del món i que es pot copiar lliurement complint certes condicions.
es: [Linux:] un sistema operativo multitarea y multiusuario gratuito, del estilo de Unix que se podía encontrar en los miniordenadores, desarrollado de manera no lucrativa por miles de voluntarios en todo el mundo y que se puede copiar libremente cumpliendo ciertas condiciones.

source: El nom algorisme ve del nom d'un matemàtic que treballava a Bagdad vora l'any 825 de la nostra era, Muhammad ibn Musa al Khwarizmi, anomenat així perquè sembla que era d'una ciutat al sud del mar d'Aral anomenada Khwarizm (ara Kheva).
es: El nombre algoritmo </ i0> viene del nombre de un matemático que trabajaba en Bagdad cerca del año 825 de nuestra era, Muhammad ibn Musa al Khwarizmi, llamado así porque se cree que pertenecía de una ciudad al sur del Mar de Aral llamada Khwarizm (ahora Kheva).

source: [USB] (de l'anglés universal serial bus, bus sèrie universal): Estàndard o norma de connexió de dispositius perifèrics (impressores, mòdems, reproductors digitals de música, càmeres digitals, unitats de memòria) que transmet les dades en sèrie (és a dir, un bit darrere de l'altre) a velocitats que poden arribar als 12 Mbps, i que permet la connexió i desconnexió de dispositius ``en calent'', és a dir, sense haver d'apagar l'ordinador.
es: (USB) (del inglés universal serial bus </ i0>, bus serie universal): Estándar o norma de conexión de dispositivos periféricos (impresoras, módems, reproductores digitales de música, cámaras digitales, unidades de memoria) que transmite los datos en serie (es decir, un bit detrás del otro) a velocidades que pueden alcanzar los 12 Mbps, y que permite la conexión y desconexión de dispositivos " en caliente", es decir, sin tener que apagar el ordenador.

source: Hi ha mòdems interns, que s'instal·len dins de la caixa o torre de l'ordinador, i externs.
es: Hay módems internos, que se instalan dentro de la caja o torre del ordenador, y externosó

source: També anomenats documents o arxius.
es: También llamados documentos </ i0> o archivos </ i1>.

source: [targeta de xarxa:] per a connectar ordinadors i formar una xarxa (normalment local) per a compartir recursos, cada ordinador ha de tenir una placa o targeta de xarxa.
es: [Tarjeta de red:] para conectar ordenadores y formar una red (normalmente local) para compartir recursos, cada ordenador debe tener una placa o tarjeta de red.

source: Aquest glossari arreplega alguns termes d'ús comú en la descripció d'ordinadors i programes que no han estat definits més amunt.
es: Este glosario recoge algunos términos de uso común en la descripción de ordenadores y programas que no han sido definidos más arriba.

source: Com ja s'ha dit en la pàgina , és comú que les dades ---de qualsevol classe: textos, programes, gràfics, so, vídeo, etc.--- emmagatzemades en memòria secundària estiguen organitzades en { fitxers}.
es: Como ya se ha dicho en la página , es habitual que los datos --- de cualquier clase: textos, programas, gráficos, sonido, vídeo, etc. --- Almacenados en memoria secundaria estén organizadas en {<u0 > archivos} .

source: [Portàtils] (en anglés laptop i de vegades notebook): Tenen una grandària menor que la d'un maletí i un pes lleuger que permet dur-los sense massa esforç d'un lloc a un altre.
es: [Portátiles] (en inglés laptop </ i2> a veces notebook </ i3>): Tienen un tamaño menor que el de un maletín y su peso ligero que permite llevarlos sin demasiado esfuerzo de un lugar a otro.

source: Per exemple, un document de text com aquest té desenes de milers de caràcters, i una enciclopèdia, centenars de milions.
es: Por ejemplo, un documento de texto como éste tiene decenas de miles de caracteres, y una enciclopedia, cientos de millones.

source: Si quan s'ha demanat la 2.000.000 es copien en la memòria cau les 524.288 posicions que van de la 1.572.864 a la 2.097.151, l'accés a la posició 2.000.003 serà més ràpida.
es: Si cuando se ha pedido la 2.000.000 se copian en el caché </ i2> las 524.288 posiciones que van de la 1572864 a la 2097151, el acceso a la posición 2.000.003 será más rápido

source: Actualment no és estrany que una unitat de CD-ROM tinga una velocitat punta de lectura i d'escriptura de 52$$ o més.
es: Actualmente no es extraño que una unidad de CD-ROM tenga una velocidad punta de lectura y de escritura de 52X o más.

source: [5.] Suma 1 a $p$.
es: ] Suma 1 a $ p $.

source: [DSL] (de l'anglés digital subscriber line, línia d'abonat digital), Tecnología de connexió que permet aprofitar les línies telefòniques i elèctriques per a fer connexions d'alta velocitat (des dels 128 kbps fins als 2 Mbps).
es: [DSL] (del inglés digital subscriber line, línea de abonado digital), tecnología de conexión que permite aprovechar las líneas telefónicas y eléctricas para hacer conexiones de alta velocidad ( desde 128 kbps hasta los 2 Mbps)

source: Si el disc es diu a: (típic d'un disquet en un PC amb sistema operatiu Windows), les trajectòries d'aquests dos fitxers serien a:{}{prac1}{iat}iat1.txt i a:{}{prac1}{reserva}{iat}iat1.txt, i, per tant, serien diferents.
es: Si el disco se llama a: </ i4> (típico de un disquete en un PC con sistema operativo Windows), las trayectorias de estos dos ficheros serían a: </ i5> { } {prac1} {iat} iat1.txt </ e6> y a: </ i7> {} {prac1} {reserva} {iat} iat1.txt </ i8>, y, por tanto, serían diferentes.

source: Si existira un llenguatge de programació de l'estil de Pascal en català, potser tindria una forma com aquesta:
es: Si existiera un lenguaje de programación del estilo de Pascal en catalán, quizás tendría una forma como esta:

source: El directori ``{reserva}'' conté un subdirectori ``{iat}'' (que conté l'arxiu ``iat1.txt)''.
es: El directorio " {reserva}" contiene un subdirectorio " {iat}" (que contiene el archivo " iat1.txt </ i2>)".

source: Les instruccions dels programes, com el de l'exemple, que sumava tots els enters del 1 al 10, també s'emmagatzemen en octets: per exemple, la instrucció { inc A}, que incrementa l'acumulador en 1, podria ser l'octet { 11010110}.
es: Las instrucciones de los programas, como el del ejemplo, que sumaban todos los enteros del 1 al 10, también se almacenan en bytes: por ejemplo, la instrucción { inc A}, que incrementa el acumulador en 1, podría ser el byte { 11010110}.

source: [4.] Suma 1 a p. [5.] Vés al pas 2.
es: ] Suma 1 a p. Ve al paso 2 [5.

source: D'altra banda, sovint es fa la distinció entre els ordinadors de tipus PC i els Macinstosh (sovint anomenats Mac); els PC són l'evolució dels primers ordinadors personals desenvolupats per IBM, tot i que actualment són fabricats per un nombre molt gran d'empreses; els Mac són fabricats exclusivament per l'empresa Apple Computers, tenen un sistema operatiu propi i una quota de mercat molt més reduïda.
es: Por otro lado, a menudo se hace la distinción entre los ordenadores de tipo PC y los Macintosh (conocidos también como Mac), los PC son la evolución de los primeros ordenadores personales desarrollados por IBM, aunque actualmente son fabricados por un número muy grande de empresas; los Mac son fabricados exclusivamente por la empresa Apple Computers, tienen un sistema operativo propio y una cuota de mercado mucho más reducida

source: També és possible (i molt còmoda) la connexió sense fils (vegeu Wi-Fi en aquest glossari).
es: También es posible (y muy cómoda) la conexión inalámbrica (ver Wi-Fi </ i0> en este glosario).

source: } Si es pot suposar que a les cadenes de caràcters s'afegeix un símbol especial de final de cadena (per exemple, `\$'), l'algorisme se simplifica:
es: } Si se puede suponer que en las cadenas de caracteres se añade un símbolo especial de fin de cadena (por ejemplo, '$'), el algoritmo se simplifica

source: De fet, com en el cas dels kilooctets, no exactament: $$1 MB = 1.024 1.024 octets= 1.048.576 octets.$$ gigaoctets o gigabytes (GB), o milers de milions ---una mica més--- d'octets: $$1 GB=1.024 MB=1.048.576 kB=1.073.741.824 octets.$$
es: De hecho, como en el caso de los kilobytes, no exactamente: 1 MB </ e6> = 1.024 x 1.024 bytes </ i7> = 1.048.576 bytes </ i8>. gigabytes </ i4> (GB), o miles de millones --- un poco más --- de bytes: 1 GB < / i9> = 1.024 MB </ i10> = 1.048.576 KB </ I11> = 1073741824 bytes </ i12>.

source: [GHz:] vegeu gigahertz.
es: [GHz:] ver gigahertz.

source: Però, el seu volum reduït limita les possibilitats de fer-hi ampliacions i, per tant, el seu temps de vida és sovint més curt que el dels ordinadors de sobretaula.
es: Sin embargo,su volumen reducido limita las posibilidades de hacer ampliaciones y, por tanto, su tiempo de vida es ,a menudo, más corto que el de los ordenadores de sobremesa.

source: [mòdem:] abreviatura de modulador-desmodulador.
es: [Módem:] abreviatura de modulador-demodulador..

source: [1.] Fes que $p$ valga 1.
es: ] Haz que $ p $ valga 1.

source: La seqüència dels noms de les carpetes que cal anar obrint fins que arribem a un fitxer s'anomena la trajectòria o la ruta del fitxer.
es: La secuencia de los nombres de las carpetas que hay que ir abriendo hasta que lleguemos a un fichero se conoce como trayectoria </ i0> o ruta </ ??i1> del fichero.

source: Una velocitat més gran implica una velocitat d'execució més gran, sempre que no hi haja altres circumstàncies limitants (per exemple, una falta de memòria).
es: Una velocidad más alta implica una velocidad de ejecución más alta, siempre que no haya otras circustancias limitantes( por ejemplo, falta de memoria).

source: El llibre és bàsicament una compilació de procediments algebraics i geomètrics, és a dir, d'algorismes.
es: El libro es básicamente una compilación de procedimientos algebraicos y geométricos, es decir, de algoritmos </ i3>.
